; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	satellite3 - satellite
	instrument3 - instrument
	infrared1 - mode
	spectrograph2 - mode
	infrared0 - mode
	Star2 - direction
	Star1 - direction
	GroundStation0 - direction
	Star3 - direction
	Phenomenon4 - direction
	Phenomenon5 - direction
	Star6 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 Star1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon5)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 136)
	(supports instrument1 infrared1)
	(supports instrument1 infrared0)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 GroundStation0)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation0)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 156)
	(supports instrument2 spectrograph2)
	(supports instrument2 infrared1)
	(calibration_target instrument2 Star1)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation0)
	(= (data_capacity satellite2) 1000)
	(= (fuel satellite2) 107)
	(supports instrument3 infrared0)
	(calibration_target instrument3 GroundStation0)
	(on_board instrument3 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star1)
	(= (data_capacity satellite3) 1000)
	(= (fuel satellite3) 125)
	(= (data Star3 infrared1) 254)
	(= (data Phenomenon4 infrared1) 276)
	(= (data Phenomenon5 infrared1) 253)
	(= (data Star6 infrared1) 8)
	(= (data Star3 spectrograph2) 170)
	(= (data Phenomenon4 spectrograph2) 94)
	(= (data Phenomenon5 spectrograph2) 120)
	(= (data Star6 spectrograph2) 57)
	(= (data Star3 infrared0) 29)
	(= (data Phenomenon4 infrared0) 185)
	(= (data Phenomenon5 infrared0) 133)
	(= (data Star6 infrared0) 230)
	(= (slew_time Star2 GroundStation0) 57.42)
	(= (slew_time GroundStation0 Star2) 57.42)
	(= (slew_time Star2 Star1) 36.17)
	(= (slew_time Star1 Star2) 36.17)
	(= (slew_time Star1 GroundStation0) 72.77)
	(= (slew_time GroundStation0 Star1) 72.77)
	(= (slew_time Star3 GroundStation0) 27.32)
	(= (slew_time GroundStation0 Star3) 27.32)
	(= (slew_time Star3 Star1) 23.97)
	(= (slew_time Star1 Star3) 23.97)
	(= (slew_time Star3 Star2) 45.66)
	(= (slew_time Star2 Star3) 45.66)
	(= (slew_time Phenomenon4 GroundStation0) 33.3)
	(= (slew_time GroundStation0 Phenomenon4) 33.3)
	(= (slew_time Phenomenon4 Star1) 32.78)
	(= (slew_time Star1 Phenomenon4) 32.78)
	(= (slew_time Phenomenon4 Star2) 12.43)
	(= (slew_time Star2 Phenomenon4) 12.43)
	(= (slew_time Phenomenon4 Star3) 16.86)
	(= (slew_time Star3 Phenomenon4) 16.86)
	(= (slew_time Phenomenon5 GroundStation0) 33.71)
	(= (slew_time GroundStation0 Phenomenon5) 33.71)
	(= (slew_time Phenomenon5 Star1) 9.628)
	(= (slew_time Star1 Phenomenon5) 9.628)
	(= (slew_time Phenomenon5 Star2) 53.34)
	(= (slew_time Star2 Phenomenon5) 53.34)
	(= (slew_time Phenomenon5 Star3) 14.21)
	(= (slew_time Star3 Phenomenon5) 14.21)
	(= (slew_time Phenomenon5 Phenomenon4) 7.175)
	(= (slew_time Phenomenon4 Phenomenon5) 7.175)
	(= (slew_time Star6 GroundStation0) 87.91)
	(= (slew_time GroundStation0 Star6) 87.91)
	(= (slew_time Star6 Star1) 33.64)
	(= (slew_time Star1 Star6) 33.64)
	(= (slew_time Star6 Star2) 21)
	(= (slew_time Star2 Star6) 21)
	(= (slew_time Star6 Star3) 20.52)
	(= (slew_time Star3 Star6) 20.52)
	(= (slew_time Star6 Phenomenon4) 73.5)
	(= (slew_time Phenomenon4 Star6) 73.5)
	(= (slew_time Star6 Phenomenon5) 26.63)
	(= (slew_time Phenomenon5 Star6) 26.63)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(pointing satellite0 Phenomenon5)
	(pointing satellite3 Star6)
	(have_image Star3 spectrograph2)
	(have_image Phenomenon4 infrared1)
	(have_image Phenomenon5 spectrograph2)
	(have_image Star6 infrared1)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite3 star6 star1)
   deleted: (pointing satellite3 star1)
   added: (pointing satellite3 star6)
   changed: (fuel satellite3) from 125 to 91.36, (fuel-used) from 0 to 33.64
   goals met: 2 of 6
2. (turn_to satellite0 star3 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 star3)
   changed: (fuel satellite0) from 136 to 121.79, (fuel-used) from 33.64 to 47.85
   goals met: 1 of 6
3. (turn_to satellite0 phenomenon5 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 phenomenon5)
   changed: (fuel satellite0) from 121.79 to 107.58, (fuel-used) from 47.85 to 62.06
   goals met: 2 of 6
4. (turn_to satellite0 star3 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 star3)
   changed: (fuel satellite0) from 107.58 to 93.37, (fuel-used) from 62.06 to 76.27
   goals met: 1 of 6
5. (turn_to satellite0 phenomenon5 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 phenomenon5)
   changed: (fuel satellite0) from 93.37 to 79.16, (fuel-used) from 76.27 to 90.48
   goals met: 2 of 6
6. (turn_to satellite0 star3 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 star3)
   changed: (fuel satellite0) from 79.16 to 64.95, (fuel-used) from 90.48 to 104.69
   goals met: 1 of 6
7. (turn_to satellite0 phenomenon5 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 phenomenon5)
   changed: (fuel satellite0) from 64.95 to 50.74, (fuel-used) from 104.69 to 118.9
   goals met: 2 of 6
8. (turn_to satellite0 star3 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 star3)
   changed: (fuel satellite0) from 50.74 to 36.53, (fuel-used) from 118.9 to 133.11
   goals met: 1 of 6
9. (turn_to satellite0 star1 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 star1)
   changed: (fuel satellite0) from 36.53 to 12.56, (fuel-used) from 133.11 to 157.08
   goals met: 1 of 6
10. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 1 of 6
11. (turn_to satellite1 star3 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 star3)
   changed: (fuel satellite1) from 156 to 128.68, (fuel-used) from 157.08 to 184.4
   goals met: 1 of 6
12. (turn_to satellite1 groundstation0 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 groundstation0)
   changed: (fuel satellite1) from 128.68 to 101.36, (fuel-used) from 184.4 to 211.72
   goals met: 1 of 6
13. (calibrate satellite1 instrument1 groundstation0)
   added: (calibrated instrument1)
   goals met: 1 of 6
14. (turn_to satellite1 star3 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 star3)
   changed: (fuel satellite1) from 101.36 to 74.04, (fuel-used) from 211.72 to 239.04
   goals met: 1 of 6
15. (take_image satellite1 star3 instrument1 spectrograph2)
   added: (have_image star3 spectrograph2)
   changed: (data_capacity satellite1) from 1000 to 830, (data-stored) from 0 to 170
   goals met: 2 of 6
16. (turn_to satellite1 star6 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 star6)
   changed: (fuel satellite1) from 74.04 to 53.52, (fuel-used) from 239.04 to 259.56
   goals met: 2 of 6
17. (take_image satellite1 star6 instrument1 infrared1)
   added: (have_image star6 infrared1)
   changed: (data_capacity satellite1) from 830 to 822, (data-stored) from 170 to 178
   goals met: 3 of 6
18. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 6
19. (calibrate satellite0 instrument0 star1)
   added: (calibrated instrument0)
   goals met: 3 of 6
20. (turn_to satellite0 phenomenon5 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 phenomenon5)
   changed: (fuel satellite0) from 12.56 to 2.932, (fuel-used) from 259.56 to 269.188
   goals met: 4 of 6
21. (turn_to satellite1 star2 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star2)
   changed: (fuel satellite1) from 53.52 to 32.52, (fuel-used) from 269.188 to 290.188
   goals met: 4 of 6
22. (turn_to satellite1 phenomenon4 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 phenomenon4)
   changed: (fuel satellite1) from 32.52 to 20.09, (fuel-used) from 290.188 to 302.618
   goals met: 4 of 6
23. (take_image satellite1 phenomenon4 instrument1 infrared1)
   added: (have_image phenomenon4 infrared1)
   changed: (data_capacity satellite1) from 822 to 546, (data-stored) from 178 to 454
   goals met: 5 of 6
24. (take_image satellite0 phenomenon5 instrument0 spectrograph2)
   added: (have_image phenomenon5 spectrograph2)
   changed: (data_capacity satellite0) from 1000 to 880, (data-stored) from 454 to 574
   goals met: 6 of 6
